Repository: permissionlesstech/bitchat
Catalog: bitchat/Localization/Localizable.xcstrings
Source language: en
Languages: ar, es, fr, zh_hans

# accessibility.add_favorite
source: Add to favorites
ar: إضافة إلى المفضلة
es: Añadir a favoritos
fr: Ajouter aux favoris
zh_hans: 加入收藏

# accessibility.available_nostr
source: Available via Nostr
ar: متاح عبر Nostr
es: Disponible vía Nostr
fr: Disponible via Nostr
zh_hans: 可通过 Nostr

# accessibility.back_to_main
source: Back to main chat
ar: العودة إلى الدردشة الرئيسية
es: Volver al chat principal
fr: Retour au chat principal
zh_hans: 返回主聊天

# accessibility.connected_mesh
source: Connected via mesh
ar: متصل عبر الشبكة
es: Conectado por malla
fr: Connecté via maillage
zh_hans: 通过网状连接

# accessibility.encryption_status
source: Encryption status: %@
ar: حالة التشفير: %@
es: Estado de cifrado: %@
fr: État du chiffrement : %@
zh_hans: 加密状态：%@

# accessibility.location_channels
source: location channels
ar: قنوات الموقع
es: canales de ubicación
fr: canaux de localisation
zh_hans: 位置频道

# accessibility.open_unread_private_chat
source: Open unread private chat
ar: فتح دردشة خاصة غير مقروءة
es: Abrir chat privado no leído
fr: Ouvrir une discussion privée non lue
zh_hans: 打开未读私聊

# accessibility.people_count.one
source: %d person
ar: %d شخص
es: %d persona
fr: %d personne
zh_hans: %d 人

# accessibility.people_count.other
source: %d people
ar: %d أشخاص
es: %d personas
fr: %d personnes
zh_hans: %d 人

# accessibility.private_chat_with
source: Private chat with %@
ar: دردشة خاصة مع %@
es: Chat privado con %@
fr: Discussion privée avec %@
zh_hans: 与 %@ 的私聊

# accessibility.remove_favorite
source: Remove from favorites
ar: إزالة من المفضلة
es: Quitar de favoritos
fr: Retirer des favoris
zh_hans: 从收藏移除

# accessibility.send_message
source: Send message
ar: إرسال رسالة
es: Enviar mensaje
fr: Envoyer le message
zh_hans: 发送消息

# accessibility.send_message_hint_empty
source: Enter a message to send
ar: أدخل رسالة لإرسالها
es: Escribe un mensaje para enviar
fr: Saisissez un message à envoyer
zh_hans: 输入要发送的消息

# accessibility.send_message_hint_ready
source: Double tap to send
ar: اضغط مرتين للإرسال
es: Tocar dos veces para enviar
fr: Touchez deux fois pour envoyer
zh_hans: 双击发送

# accessibility.toggle_favorite_hint
source: Double tap to toggle favorite status
ar: انقر مرتين لتبديل المفضلة
es: Tocar dos veces para cambiar favorito
fr: Touchez deux fois pour basculer le favori
zh_hans: 双击切换收藏状态

# accessibility.view_fingerprint_hint
source: Tap to view encryption fingerprint
ar: اضغط لعرض بصمة التشفير
es: Toca para ver la huella de cifrado
fr: Touchez pour voir l’empreinte de chiffrement
zh_hans: 点按查看加密指纹

# action.screenshot.core
source: took a screenshot
ar: التقط لقطة شاشة
es: tomó una captura de pantalla
fr: a pris une capture d’écran
zh_hans: 截了图

# action.screenshot.self
source: you took a screenshot
ar: لقد التقطت لقطة شاشة
es: tomaste una captura de pantalla
fr: vous avez pris une capture d’écran
zh_hans: 你截了图

# actions.block
source: BLOCK
ar: حظر
es: BLOQUEAR
fr: BLOQUER
zh_hans: 屏蔽

# actions.copy_message
source: Copy message
ar: نسخ الرسالة
es: Copiar mensaje
fr: Copier le message
zh_hans: 复制消息

# actions.hug
source: hug
ar: عناق
es: abrazo
fr: câlin
zh_hans: 拥抱

# actions.mention
source: mention
ar: إشارة
es: mencionar
fr: mentionner
zh_hans: 提及

# actions.private_message
source: private message
ar: رسالة خاصة
es: message privé
fr: message privé
zh_hans: 私信

# actions.slap
source: slap
ar: صفعة
es: bofetada
fr: gifle
zh_hans: 拍一下

# actions.title
source: Actions
ar: إجراءات
es: Acciones
zh_hans: 操作

# actions.unblock
source: Unblock
ar: إلغاء الحظر
es: Desbloquear
fr: Débloquer
zh_hans: 取消屏蔽

# alert.bluetooth.off_message
source: Bluetooth is turned off. Please turn on Bluetooth in Settings to use BitChat.
ar: Bluetooth مُعطّل. فعّل Bluetooth من الإعدادات لاستخدام bitchat.
es: Bluetooth está desactivado. Actívalo en Ajustes para usar bitchat.
fr: Le Bluetooth est désactivé. Activez-le dans Réglages pour utiliser bitchat.
zh_hans: 蓝牙已关闭。请在“设置”中打开蓝牙以使用 bitchat。

# alert.bluetooth.unauthorized_message
source: BitChat needs Bluetooth permission to connect with nearby devices. Please enable Bluetooth access in Settings.
ar: يحتاج bitchat إلى إذن Bluetooth للاتصال بالأجهزة القريبة. فعّل الوصول من الإعدادات.
es: bitchat necesita permiso de Bluetooth para conectarse con dispositivos cercanos. Activa el acceso en Ajustes.
fr: bitchat a besoin de l’autorisation Bluetooth pour se connecter aux appareils à proximité. Activez l’accès dans Réglages.
zh_hans: bitchat 需要蓝牙权限以连接附近设备。请在“设置”中启用蓝牙访问。

# alert.bluetooth.unsupported_message
source: This device does not support Bluetooth. BitChat requires Bluetooth to function.
ar: هذا الجهاز لا يدعم Bluetooth. يتطلب bitchat وجود Bluetooth للعمل.
es: Este dispositivo no admite Bluetooth. bitchat requiere Bluetooth para funcionar.
fr: Cet appareil ne prend pas en charge le Bluetooth. bitchat nécessite le Bluetooth pour fonctionner.
zh_hans: 此设备不支持蓝牙。bitchat 需要蓝牙才能运行。

# alert.bluetooth_required
source: Bluetooth Required
ar: يتطلب البلوتوث
es: Se requiere Bluetooth
fr: Bluetooth requis
zh_hans: 需要蓝牙

# appinfo.features.encryption.desc
source: private messages encrypted with noise protocol
ar: رسائل خاصة مشفرة ببروتوكول Noise
es: mensajes privados cifrados con Noise
fr: messages privés chiffrés avec Noise
zh_hans: 私信使用 Noise 协议加密

# appinfo.features.encryption.title
source: end-to-end encryption
ar: تشفير شامل
es: cifrado de extremo a extremo
fr: chiffrement de bout en bout
zh_hans: 端到端加密

# appinfo.features.extended_range.desc
source: messages relay through peers, going the distance
ar: الرسائل تُرحّل عبر الأقران لمسافات أطول
es: los mensajes se retransmiten entre pares
fr: messages relayés entre pairs, à plus grande distance
zh_hans: 消息通过节点中继，传得更远

# appinfo.features.extended_range.title
source: extended range
ar: نطاق ممتد
es: alcance étendu
fr: portée étendue
zh_hans: 扩展范围

# appinfo.features.favorites.desc
source: get notified when your favorite people join
ar: تلقَّ إشعارًا عند انضمام المفضلين
es: recibe avisos cuando se unan tus favoritos
fr: notification à l’arrivée de vos favoris
zh_hans: 喜爱的人加入时提醒

# appinfo.features.favorites.title
source: favorites
ar: المفضلة
es: favoritos
fr: favoris
zh_hans: 收藏

# appinfo.features.geohash.desc
source: geohash channels to chat with people in nearby regions over decentralized anonymous relays
ar: قنوات geohash للدردشة محليًا عبر مرحلات لامركزية
es: canales geohash para chatear con gente cercana
fr: canaux geohash pour discuter avec des personnes proches via des relais décentralisés
zh_hans: 通过去中心化匿名中继的 geohash 频道

# appinfo.features.geohash.title
source: local channels
ar: قنوات محلية
es: canales locales
fr: canaux locaux
zh_hans: 本地频道

# appinfo.features.mentions.desc
source: use @nickname to notify specific people
ar: استخدم @الاسم لتنبيه أشخاص محددين
es: usa @apodo para notificar
fr: utilisez @pseudo pour notifier
zh_hans: 使用 @昵称 提醒特定用户

# appinfo.features.mentions.title
source: mentions
ar: إشارات
es: menciones
zh_hans: 提及

# appinfo.features.offline.desc
source: works without internet using Bluetooth low energy
ar: يعمل بدون إنترنت باستخدام بلوتوث منخفض الطاقة
es: funciona sin internet con Bluetooth Low Energy
fr: fonctionne sans internet via Bluetooth Low Energy
zh_hans: 使用低功耗蓝牙，无需互联网

# appinfo.features.offline.title
source: offline communication
ar: اتصال دون إنترنت
es: comunicación sin conexión
fr: communication hors ligne
zh_hans: 离线通信

# appinfo.features.title
source: FEATURES
ar: الميزات
es: FUNCIONES
fr: FONCTIONNALITÉS
zh_hans: 功能

# appinfo.howto.bullet.clear
source: • triple-tap chat to clear
ar: • انقر ثلاثًا لمسح الدردشة
es: • triple toque para borrar
fr: • triple touchez pour effacer
zh_hans: • 三击聊天清除

# appinfo.howto.bullet.commands
source: • type / for commands
ar: • اكتب / للأوامر
es: • escribe / para comandos
fr: • tapez / pour les commandes
zh_hans: • 输入 / 查看命令

# appinfo.howto.bullet.dm
source: • tap a peer's name to start a DM
ar: • اضغط الاسم لبدء رسالة خاصة
es: • toca un nombre para iniciar DM
fr: • touchez un nom pour démarrer un MP
zh_hans: • 点按昵称开始私聊

# appinfo.howto.bullet.mesh
source: • tap #mesh to change channels
ar: • اضغط #mesh لتغيير القنوات
es: • toca #mesh para cambiar de canal
fr: • touchez #mesh pour changer de canal
zh_hans: • 点按 #mesh 切换频道

# appinfo.howto.bullet.nickname
source: • set your nickname by tapping it
ar: • اضغط لضبط لقبك
es: • toca para fijar tu apodo
fr: • touchez pour définir votre pseudo
zh_hans: • 轻点设置你的昵称

# appinfo.howto.bullet.sidebar
source: • tap people icon for sidebar
ar: • اضغط أيقونة الأشخاص للشريط الجانبي
es: • toca el icono de personas para la barre latérale
fr: • touchez l’icône personnes pour la barre latérale
zh_hans: • 点按人员图标打开侧边栏

# appinfo.howto.title
source: HOW TO USE
ar: كيفية الاستخدام
es: CÓMO USAR
fr: COMMENT UTILISER
zh_hans: 使用方法

# appinfo.privacy.ephemeral.desc
source: new peer ID generated regularly
ar: إنشاء معرف جديد بانتظام
es: nuevo ID generado regularmente
fr: nouvel ID pair généré régulièrement
zh_hans: 定期生成新的节点 ID

# appinfo.privacy.ephemeral.title
source: ephemeral identity
ar: هوية مؤقتة
es: identidad efímera
fr: identité éphémère
zh_hans: 临时身份

# appinfo.privacy.no_tracking.desc
source: no servers, accounts, or data collection
ar: لا خوادم ولا حسابات ولا جمع بيانات
es: sin servidores, cuentas ni recopilación de datos
fr: pas de serveurs, comptes ni collecte de données
zh_hans: 无服务器、账户或数据收集

# appinfo.privacy.no_tracking.title
source: no tracking
ar: بدون تتبع
es: sin seguimiento
fr: aucun suivi
zh_hans: 不跟踪

# appinfo.privacy.panic.desc
source: triple-tap logo to instantly clear all data
ar: انقر على الشعار ثلاث مرات لمسح كل البيانات
es: toca tres veces el logo para borrar todo
fr: triple-touchez le logo pour tout effacer
zh_hans: 三击徽标立即清除所有数据

# appinfo.privacy.panic.title
source: panic mode
ar: وضع الذعر
es: modo pánico
fr: mode panique
zh_hans: 紧急模式

# appinfo.privacy.title
source: PRIVACY
ar: الخصوصية
es: PRIVACIDAD
fr: CONFIDENTIALITÉ
zh_hans: 隐私

# appinfo.warning.message
source: private message security has not yet been fully audited. do not use for critical situations until this warning disappears.
ar: أمان الرسائل الخاصة لم يُدقق بالكامل بعد. لا تستخدم في الحالات الحرجة حتى يزول هذا التحذير.
es: la seguridad de mensajes privados no ha sido auditada por completo. no usar en casos críticos hasta nuevo aviso.
fr: la sécurité des messages privés n’a pas encore été entièrement auditée. ne pas utiliser pour des situations critiques jusqu’à la disparition de cet avertissement.
zh_hans: 私信安全尚未完全审计。在此警告消失前请勿用于关键场景。

# appinfo.warning.title
source: WARNING
ar: تحذير
es: ADVERTENCIA
fr: AVERTISSEMENT
zh_hans: 警告

# channel.mesh
source: Mesh
ar: شبكة
es: Malla
fr: Maillage
zh_hans: 网状

# cmd.block.help
source: Block or list blocked peers. Usage: /block [nickname]
ar: حظر أو عرض المحظورين. الاستخدام: /block [اسم]
es: Bloquea o lista usuarios bloqueados. Uso: /block [apodo]
fr: Bloquer ou lister les bloqués. Utilisation : /block [pseudo]
zh_hans: 屏蔽或列出已屏蔽用户。用法：/block [昵称]

# cmd.block.title
source: Block
ar: حظر
es: Bloquear
fr: Bloquer
zh_hans: 屏蔽

# cmd.clear.help
source: Clear chat messages. Usage: /clear
ar: مسح الرسائل. الاستخدام: /clear
es: Borra los mensajes. Uso: /clear
fr: Efface les messages. Utilisation : /clear
zh_hans: 清除聊天消息。用法：/clear

# cmd.clear.title
source: Clear
ar: مسح
es: Limpiar
fr: Effacer
zh_hans: 清除

# cmd.fav.help
source: Add to favorites. Usage: /fav <nickname>
ar: إضافة إلى المفضلة. الاستخدام: /fav <اسم>
es: Añadir a favoritos. Uso: /fav <apodo>
fr: Ajouter aux favoris. Utilisation : /fav <pseudo>
zh_hans: 加入收藏。用法：/fav <昵称>

# cmd.fav.title
source: Favorite
ar: مفضلة
es: Favori
fr: Favori
zh_hans: 收藏

# cmd.help.help
source: Show this help. Usage: /help
ar: عرض هذه المساعدة. الاستخدام: /help
es: Mostrar esta ayuda. Uso: /help
fr: Afficher cette aide. Utilisation : /help
zh_hans: 显示此帮助。用法：/help

# cmd.help.title
source: Help
ar: مساعدة
es: Ayuda
fr: Aide
zh_hans: 帮助

# cmd.hug.help
source: Send someone a warm hug. Usage: /hug <nickname>
ar: أرسل عناقًا. الاستخدام: /hug <اسم>
es: Envía un abrazo. Uso: /hug <apodo>
fr: Envoyer un câlin. Utilisation : /hug <pseudo>
zh_hans: 发送拥抱。用法：/hug <昵称>

# cmd.hug.title
source: Hug
ar: عناق
es: Abrazo
fr: Câlin
zh_hans: 拥抱

# cmd.msg.help
source: Send private message. Usage: /m <nickname> [message]
ar: إرسال رسالة خاصة. الاستخدام: /m <اسم> [رسالة]
es: Enviar mensaje privado. Uso: /m <apodo> [mensaje]
fr: Envoyer un message privé. Utilisation : /m <pseudo> [message]
zh_hans: 发送私信。用法：/m <昵称> [消息]

# cmd.msg.title
source: Private Message
ar: رسالة خاصة
es: Mensaje privado
fr: Message privé
zh_hans: 私信

# cmd.slap.help
source: Slap someone with a trout. Usage: /slap <nickname>
ar: صفع سمكة تراوت. الاستخدام: /slap <اسم>
es: Abofetea con una trucha. Uso: /slap <apodo>
fr: Giffler avec une truite. Utilisation : /slap <pseudo>
zh_hans: 用鳟鱼拍一下。用法：/slap <昵称>

# cmd.slap.title
source: Slap
ar: صفعة
es: Bofetada
fr: Gifle
zh_hans: 拍

# cmd.unblock.help
source: Unblock a peer. Usage: /unblock <nickname>
ar: إلغاء حظر مستخدم. الاستخدام: /unblock <اسم>
es: Desbloquear un usuario. Uso: /unblock <apodo>
fr: Débloquer un pair. Utilisation : /unblock <pseudo>
zh_hans: 取消屏蔽用户。用法：/unblock <昵称>

# cmd.unblock.title
source: Unblock
ar: إلغاء الحظر
es: Desbloquear
fr: Débloquer
zh_hans: 取消屏蔽

# cmd.unfav.help
source: Remove from favorites. Usage: /unfav <nickname>
ar: إزالة من المفضلة. الاستخدام: /unfav <اسم>
es: Quitar de favoritos. Uso: /unfav <apodo>
fr: Retirer des favoris. Utilisation : /unfav <pseudo>
zh_hans: 从收藏移除。用法：/unfav <昵称>

# cmd.unfav.title
source: Unfavorite
ar: إزالة من المفضلة
es: Quitar de favoritos
fr: Retirer des favoris
zh_hans: 取消收藏

# cmd.who.help
source: See who's online. Usage: /w
ar: عرض المتصلين. الاستخدام: /w
es: Ver quién está en línea. Uso: /w
fr: Voir qui est en ligne. Utilisation : /w
zh_hans: 查看谁在线。用法：/w

# cmd.who.title
source: Who
ar: من
es: Quién
fr: Qui
zh_hans: 在线用户

# common.cancel
source: Cancel
ar: إلغاء
es: Cancelar
fr: Annuler
zh_hans: 取消

# common.close
source: close
ar: إغلاق
es: cerrar
fr: fermer
zh_hans: 关闭

# common.copy
source: Copy
ar: نسخ
es: Copiar
fr: Copier
zh_hans: 复制

# common.done
source: DONE
ar: تم
es: OK
fr: OK
zh_hans: 完成

# common.ok
source: OK
ar: موافق
es: Aceptar
zh_hans: 确定

# common.open_settings
source: open settings
ar: فتح الإعدادات
es: abrir ajustes
fr: ouvrir les réglages
zh_hans: 打开设置

# common.show_less
source: Show less
ar: عرض أقل
es: Mostrar menos
fr: Afficher moins
zh_hans: 显示较少

# common.show_more
source: Show more
ar: عرض المزيد
es: Mostrar más
fr: Afficher plus
zh_hans: 显示更多

# common.unknown
source: Unknown
ar: غير معروف
es: Desconocido
fr: Inconnu
zh_hans: 未知

# delivery.delivered_to
source: Delivered to %@
ar: تم التسليم إلى %@
es: Entregado a %@
fr: Livré à %@
zh_hans: 已送达 %@

# delivery.failed
source: Failed: %@
ar: فشل: %@
es: Falló: %@
fr: Échec : %@
zh_hans: 失败：%@

# delivery.partial_members.one
source: Delivered to %d of %d member
ar: تم التسليم إلى %d من %d عضو
es: Entregado a %d de %d miembro
fr: Livré à %d sur %d membre
zh_hans: 已送达 %d/%d 名成员

# delivery.partial_members.other
source: Delivered to %d of %d members
ar: تم التسليم إلى %d من %d أعضاء
es: Entregado a %d de %d miembros
fr: Livré à %d sur %d membres
zh_hans: 已送达 %d/%d 名成员

# delivery.partial_ratio
source: Delivered to %d/%d
ar: تم التسليم %d/%d
es: Entregado a %d/%d
fr: Livré %d/%d
zh_hans: 送达 %d/%d

# delivery.read_by
source: Read by %@
ar: قُرِئ بواسطة %@
es: Leído por %@
fr: Lu par %@
zh_hans: 已读：%@

# delivery.sending
source: Sending...
ar: جارٍ الإرسال...
es: Enviando...
fr: Envoi…
zh_hans: 发送中...

# delivery.sent
source: Sent
ar: تم الإرسال
es: Enviado
fr: Envoyé
zh_hans: 已发送

# errors.invalid_geohash
source: invalid geohash
ar: geohash غير صالح
es: geohash no válido
fr: geohash invalide
zh_hans: 无效的 geohash

# fp.compare_instruction
source: compare these fingerprints with %@ using a secure channel.
ar: قارن هذه البصمات مع %@ باستخدام قناة آمنة.
es: compara estas huellas con %@ usando un canal seguro.
fr: comparez ces empreintes avec %@ via un canal sécurisé.
zh_hans: 通过安全渠道将这些指纹与 %@ 比较。

# fp.handshake_in_progress
source: not available - handshake in progress
ar: غير متاح - المصافحة جارية
es: no disponible - apretón de manos en curso
fr: non disponible - poignée de main en cours
zh_hans: 不可用——握手进行中

# fp.mark_verified
source: MARK AS VERIFIED
ar: وضع علامة كمتحقق
es: MARCAR COMO VERIFICADO
fr: MARQUER COMME VÉRIFIÉ
zh_hans: 标记为已验证

# fp.not_verified
source: ⚠️ NOT VERIFIED
ar: ⚠️ غير مُتحقق
es: ⚠️ NO VERIFICADO
fr: ⚠️ NON VÉRIFIÉ
zh_hans: ⚠️ 未验证

# fp.status.secured
source: secured
ar: مؤمّن
es: asegurado
fr: sécurisé
zh_hans: 已加密

# fp.status.unencrypted
source: not encrypted
ar: غير مشفر
es: no cifrado
fr: non chiffré
zh_hans: 未加密

# fp.status.verified
source: verified
ar: مُتحقق
es: verificado
fr: vérifié
zh_hans: 已验证

# fp.their
source: THEIR FINGERPRINT:
ar: بصمتهم:
es: HUELLA (ELLOS):
fr: LEUR EMPREINTE :
zh_hans: 对方指纹：

# fp.title
source: SECURITY VERIFICATION
ar: التحقق الأمني
es: VERIFICACIÓN DE SEGURIDAD
fr: VÉRIFICATION DE SÉCURITÉ
zh_hans: 安全验证

# fp.verified
source: ✓ VERIFIED
ar: ✓ مُتحقق
es: ✓ VERIFICADO
fr: ✓ VÉRIFIÉ
zh_hans: ✓ 已验证

# fp.verified.detail
source: you have verified this person's identity.
ar: لقد تحققت من هوية هذا الشخص.
es: has verificado la identidad de esta persona.
fr: vous avez vérifié l’identité de cette personne.
zh_hans: 你已验证此人的身份。

# fp.yours
source: YOUR FINGERPRINT:
ar: بصمتك:
es: TU HUELLA:
fr: VOTRE EMPREINTE :
zh_hans: 你的指纹：

# help.title
source: How to Use
ar: كيفية الاستخدام
es: Cómo usar
fr: Mode d’emploi
zh_hans: 使用指南

# label.you_suffix
source: (you)
ar: (أنت)
es: (tú)
fr: (vous)
zh_hans: （你）

# location.about
source: chat with people near you using geohash channels. only a coarse geohash is shared, never exact gps.
ar: الدردشة مع الأشخاص القريبين باستخدام قنوات geohash. تتم مشاركة geohash تقريبي فقط، وليس GPS الدقيق.
es: chatea con personas cercanas usando canales geohash. solo se comparte un geohash aproximado, nunca GPS exacto.
fr: discutez avec des personnes proches via des canaux geohash. seul un geohash approximatif est partagé, jamais un GPS précis.
zh_hans: 使用地理哈希频道与附近的人聊天。仅共享粗略 geohash，绝不共享精确 GPS。

# location.enable_action
source: get location and my geohashes
ar: الحصول على الموقع و geohash الخاص بي
es: obtener ubicación y mis geohashes
fr: obtenir la position et mes geohashes
zh_hans: 获取位置和我的 geohash

# location.finding
source: finding nearby channels…
ar: جاري العثور على قنوات قريبة…
es: buscando canales cercanos…
fr: recherche de canaux à proximité…
zh_hans: 正在查找附近频道…

# location.level.block
source: Block
ar: مربّع
es: Bloque
fr: Bloc
zh_hans: 街区

# location.level.city
source: City
ar: مدينة
es: Ciudad
fr: Ville
zh_hans: 城市

# location.level.country
source: Country
ar: بلد
es: País
fr: Pays
zh_hans: 国家

# location.level.neighborhood
source: Neighborhood
ar: حيّ
es: Barrio
fr: Quartier
zh_hans: 街区

# location.level.region
source: Region
ar: منطقة
es: Región
fr: Région
zh_hans: 区域

# location.mesh
source: mesh
ar: شبكة
es: malla
fr: maillage
zh_hans: 网状

# location.permission_denied
source: location permission denied. enable in settings to use location channels.
ar: تم رفض إذن الموقع. فعِّل في الإعدادات لاستخدام قنوات الموقع.
es: permiso de ubicación denegado. habilite en ajustes para usar canales de ubicación.
fr: autorisation de localisation refusée. activez-la dans Réglages pour utiliser les canaux de localisation.
zh_hans: 位置权限被拒绝。前往设置启用以使用位置频道。

# location.remove_access
source: remove location access
ar: إزالة وصول الموقع
es: quitar acceso a la ubicación
fr: retirer l’accès à la localisation
zh_hans: 移除位置访问权限

# location.teleport
source: teleport
ar: انتقال فوري
es: teletransportarse
fr: téléporter
zh_hans: 瞬移

# nav.home
source: Home
ar: الصفحة الرئيسية
es: Inicio
fr: Accueil
zh_hans: 主页

# nav.location_channels
source: #location channels
ar: #قنوات الموقع
es: #canales de ubicación
fr: #canaux de localisation
zh_hans: #位置频道

# nav.people
source: PEOPLE
ar: الأشخاص
es: PERSONAS
fr: PERSONNES
zh_hans: 联系人

# nav.settings
source: Settings
ar: الإعدادات
es: Ajustes
fr: Réglages
zh_hans: 设置

# payment.cashu
source: pay via cashu
ar: الدفع عبر cashu
es: pagar con cashu
fr: payer via cashu
zh_hans: 通过 cashu 支付

# payment.lightning
source: pay via lightning
ar: الدفع عبر lightning
es: pagar con lightning
fr: payer via lightning
zh_hans: 通过 lightning 支付

# peer.blocked
source: Blocked
ar: محظور
es: Bloqueado
fr: Bloqué
zh_hans: 已屏蔽

# peer.blocked_geohash
source: Blocked in geohash
ar: محظور في geohash
es: Bloqueado en geohash
fr: Bloqué dans geohash
zh_hans: 在 geohash 中被屏蔽

# people.none_around
source: nobody around...
ar: لا أحد بالقرب...
es: nadie cerca...
fr: personne autour...
zh_hans: 周围无人...

# placeholder.nickname
source: nickname
ar: اسم مستعار
es: apodo
fr: pseudo
zh_hans: 昵称

# share.link_title
source: Shared Link
ar: رابط مُشترك
es: Enlace compartido
fr: Lien partagé
zh_hans: 分享的链接

# share.placeholder
source: Share to bitchat...
ar: المشاركة إلى bitchat...
es: Compartir en bitchat...
fr: Partager vers bitchat...
zh_hans: 分享至 bitchat...

# share.success
source: ✓ Shared to bitchat
ar: ✓ تمّت المشاركة إلى bitchat
es: ✓ Compartido en bitchat
fr: ✓ Partagé vers bitchat
zh_hans: ✓ 已分享至 bitchat

# system.blocked_geohash
source: blocked %@ in geohash chats
ar: حُظر %@ في دردشات geohash
es: bloqueado %@ en chats geohash
fr: %@ bloqué dans les discussions geohash
zh_hans: 已在 geohash 聊天中屏蔽 %@

# system.cannot_send_blocked
source: cannot send message: user is blocked.
ar: لا يمكن إرسال الرسالة: المستخدم محظور.
es: no se puede enviar el mensaje: el usuario está bloqueado.
fr: impossible d’envoyer le message : utilisateur bloqué.
zh_hans: 无法发送消息：用户已被屏蔽。

# system.cannot_send_blocked_to
source: cannot send message to %@: user is blocked.
ar: لا يمكن إرسال رسالة إلى %@: المستخدم محظور.
es: no se puede enviar el mensaje a %@: el usuario está bloqueado.
fr: impossible d’envoyer le message à %@ : utilisateur bloqué.
zh_hans: 无法向 %@ 发送消息：用户已被屏蔽。

# system.cannot_send_not_in_location
source: cannot send: not in a location channel
ar: لا يمكن الإرسال: لست في قناة موقع
es: no se puede enviar: no estás en un canal de ubicación
fr: envoi impossible : pas dans un canal de localisation
zh_hans: 无法发送：不在位置频道中

# system.cannot_send_unreachable
source: Cannot send message to %@ - peer is not reachable via mesh or Nostr.
ar: لا يمكن إرسال رسالة إلى %@ — النظير غير قابل للوصول عبر الشبكة أو Nostr.
es: No se puede enviar el mensaje a %@: el par no es alcanzable por malla o Nostr.
fr: Impossible d’envoyer un message à %@ — pair inaccessible via mesh ou Nostr.
zh_hans: 无法向 %@ 发送消息——对端无法通过网状网络或 Nostr 到达。

# system.cannot_start_blocked
source: cannot start chat with %@: user is blocked.
ar: لا يمكن بدء محادثة مع %@: المستخدم محظور.
es: no se puede iniciar chat con %@: el usuario está bloqueado.
fr: impossible de démarrer une discussion avec %@ : utilisateur bloqué.
zh_hans: 无法与 %@ 开始聊天：用户已被屏蔽。

# system.cannot_start_need_mutual
source: cannot start chat with %@: mutual favorite required for offline messaging.
ar: لا يمكن بدء محادثة مع %@: يلزم تفضيل متبادل للرسائل دون اتصال.
es: no se puede iniciar chat con %@: se requiere favorito mutuo para mensajería offline.
fr: impossible de démarrer une discussion avec %@ : favori mutuel requis pour messagerie hors ligne.
zh_hans: 无法与 %@ 开始聊天：离线消息需要相互收藏。

# system.favorited_you
source: %@ favorited you
ar: %@ أضافك كمفضل
es: %@ te marcó como favorito
fr: %@ vous a ajouté en favori
zh_hans: %@ 将你设为收藏

# system.send_failed_location
source: failed to send to location channel
ar: فشل الإرسال إلى قناة الموقع
es: falló el envío al canal de ubicación
fr: échec de l’envoi au canal de localisation
zh_hans: 发送到位置频道失败
